# vstAddButtonMode

## Description
```pascal
PROCEDURE vstAddButtonMode(inIconSpecification : DYNARRAY[] of CHAR);
```

```python

def vs.vstAddButtonMode(inIconSpecification):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inIconSpecification|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events